tap "clintmod/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "shopify/shopify"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python"
# GNU multiple precision arithmetic library
brew "gmp"
# Emacs dependency management
brew "cask"
# Configurable talking characters in ASCII art
brew "cowsay"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Geometry Engine
brew "geos"
# Small git utilities
brew "git-extras"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Object-relational database system
brew "postgresql", restart_service: true
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Backup and Restore your Mac System and App Preferences
brew "clintmod/formulas/macprefs"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
cask "appcleaner"
cask "apple-juice"
cask "bettertouchtool"
cask "cleanmymac"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-nerd-font"
cask "google-backup-and-sync"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "macdown"
cask "plex-media-player"
cask "plexamp"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookase"
cask "scroll-reverser"
cask "skyfonts"
cask "sourcetree"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "CopyClip", id: 595191960
mas "Dynamo", id: 1445910651
mas "Jira", id: 1475897096
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
