tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "shopify/shopify"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Interpreted, interactive, object-oriented programming language
brew "python"
# SSL/TLS cryptography library
brew "openssl"
# Emacs dependency management
brew "cask"
# Configurable talking characters in ASCII art
brew "cowsay"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Small git utilities
brew "git-extras"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Object-relational database system
brew "postgresql", restart_service: true
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
cask "appcleaner"
cask "bettertouchtool"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-backup-and-sync"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "macdown"
cask "plex-media-player"
cask "plexamp"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookase"
cask "sourcetree"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
